[
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "image":"https://areknawo.com/content/images/2020/09/cover-01.png",
      "title": "Javascript Learning",
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6a/JavaScript-logo.png",
      "details": " JavaScript is a scripting or programming language that allows you to implement complex features on web pages — every time a web page does more than just sit there and display static information for you to look at — displaying timely content updates, interactive maps, animated 2D/3D graphics, scrolling video jukeboxes, etc. — you can bet that JavaScript is probably involved. It is the third layer of the layer cake of standard web technologies, two of which (HTML and CSS) we have covered in much more detail in other parts of the Learning Area. What is even more exciting however is the functionality built on top of the client-side JavaScript language. So-called Application Programming Interfaces (APIs) provide you with extra superpowers to use in your JavaScript code.APIs are ready-made sets of code building blocks that allow a developer to implement programs that would otherwise be hard or impossible to implement. They do the same thing for programming that ready-made furniture kits do for home building — it is much easier to take ready-cut panels and screw them together to make a bookshelf than it is to work out the design yourself, go and find the correct wood, cut all the panels to the right size and shape, find the correct-sized screws, and then put them together to make a bookshelf."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "image":"https://www.programmerspoint.in/images/angular-course.jpg",
      "title": "AngularJS Course",
      "image_url": "https://ih1.redbubble.net/image.453958487.1770/pp,840x830-pad,1000x1000,f8f8f8.u3.jpg",
      "details": "This AngularJS training course from Infinite Skills teaches you all about this open-source JavaScript framework. This course is designed for the absolute beginner, meaning no prior knowledge of AngularJS is required, however you should already have a fundamental understanding of HTML, CSS and JavaScript.AngularJS is an open-source framework that helps you build dynamic web applications. This module discusses the AngularJS web framework for developing single-page applications and its need.This module focuses on addressing the various features of AngularJS like Data Binding.AngularJS uses directives to add new mark-ups to HTML and turns static HTML files in to something dynamic. It is an innovative approach to incorporating HTML and developing big web applications.AngularJS organizes views, controllers, directives, filters and such other elements in to separate modules. This division becomes convenient for building and managing an application.AngularJS has a built-in dependency injection system and is unit-testable.AngularJS uses data-binding directives to provide a projection of the model to the application view. It automates synchronization of data between model and view components. This allows developers to avoid writing a considerable amount of boilerplate code."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6c",
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "image":"https://media.talentbattle.in/Files/C4U_Images/C4U_COMPANIES_LOGOS/19/Artboard%201%20copy%208-min.jpg",
      "title": "C Programming Course",
      "image_url": "https://miro.medium.com/max/750/0*tc5hGik294F0OmbC",
      "details": "C is a structured, procedural programming language that has been widely used both for operating systems and applications and that has had a wide following in the academic community. Many versions of UNIX-based operating systems are written in C. C has been standardized as part of the Portable Operating System Interface (POSIX)With the increasing popularity of object-oriented programming, C is being rapidly replaced as the programming language by C++, a superset of the C language that uses an entirely different set of programming concepts, and by Java, a language similar to but simpler than C++, that was designed for use in distributed networks.C is an imperative procedural language supporting structured programming, lexical variable scope, and recursion, with a static type system. It was designed to be compiled to provide low-level access to memory and language constructs that map efficiently to machine instructions, all with minimal runtime support. Despite its low-level capabilities, the language was designed to encourage cross-platform programming. A standards-compliant C program written with portability in mind can be compiled for a wide variety of computer platforms and operating systems with few changes to its source code.["
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6d",
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "image":"https://listabsolute.com/wp-content/uploads/2019/09/How-to-become-a-linux-system-adminastrator-730x400.jpg",
      "title": "Linux Programming Course",
      "image_url": "https://bloximages.newyork1.vip.townnews.com/redandblack.com/content/tncms/assets/v3/editorial/4/59/45940eb2-5403-11e9-a843-db0e4491cc90/5ca13d8453042.image.jpg",
      "details": "This course provides a deep understanding of the operating system architecture and low-level interfaces (principally, system calls and library functions) that are required to build system-level, multithreaded, and network applications on Linux and UNIX systems. The course consists of a mixture of detailed presentations coupled with a large number of carefully designed practical exercises that allow participants to apply the knowledge learned in the presentations.By the completion of the course, participants will have the mastery needed to write complex system, network, and multithreaded applications on a Linux or UNIX system. Previous system programming experience (on Linux, UNIX, or any other operating system) is not required.Standard courses are normally five days long, and are delivered either live online, at a public training location, or on-site at customer premises. The content may vary a little, according to specific requests and time constraints"
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6e",
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "image":"https://contentstatic.techgig.com/photo/90078705.cms",
      "title": "Java Programming Course",
      "image_url": "https://preview.redd.it/hignebst8rd41.jpg?width=640&crop=smart&auto=webp&s=5793771debaf606f9d4c5f5da3ef4898b67ad655",
      "details": "This course is paced to provide a solid foundation in Java™ for programmers without syntax experience in a C-based language. Intensive and hands-on, the course emphasizes becoming productive quickly as a Java programmer. Besides learning the basic structure and syntax of the language, students will also learn object-oriented principles and how they are applied in Java applications. The course then covers the I/O streams and collections API packages. This course is current to Java 7 and uses the Eclipse IDE.The course is designed for students with some programming experience, but if you have none and are motivated you will do fine. Students who have taken 6.005 should not take this course. Each class is composed of one hour of lecture and one hour of assisted lab work.To write Java programs, you need two things: the Java Development Kit (JDK), and a source code editor. Please follow these directions before the first class, so you can get started on the first assignment faster. If you run into difficulty, we can help you during the first class.The Java Development Kit contains the tools needed to compile and run Java programs. The source code editor lets you write programs, and has features to make this easier. For this course, you can use any tool you like, but we recommend Eclipse, and will demonstrate it during the first lecture."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6f",
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "image":"https://www.cnet.com/a/img/resize/e97f08caa05cc00998d2f45a91f865ab0208e57a/hub/2020/07/02/b678e7af-29e6-41d4-8c59-720322973a32/python-skillshare-1.jpg?auto=webp&fit=crop&height=528&width=940",
      "title": "Python Programming Course",
      "image_url": "https://images.ctfassets.net/mrop88jh71hl/55rrbZfwMaURHZKAUc5oOW/9e5fe805eb03135b82e962e92169ce6d/python-programming-language.png",
      "details": "This course introduces computer programming using the Python programming language. Emphasis is placed on common algorithms and programming principles utilizing the standard library distributed with Python.Upon completion, students should be able to design, code, test, and debug Python language programs. Course Hours per Week: Class, 2. Lab, 3. Semester Hours Credit, 3.This course provides an introduction to programming and the Python language.  Students are introduced to core programming concepts like data structures, conditionals, loops, variables, and functions.  This course includes an overview of the various tools available for writing and running Python, and gets students coding quickly.  It also provides hands-on coding exercises using commonly used data structures, writing custom functions, and reading and writing to files. This course may be more robust than some other introductory python courses, as it delves deeper into certain essential programming topics.Though Python® has been in use for nearly thirty years, it has become one of the most popular languages for software development, particularly within the fields of data science, machine learning, artificial intelligence, and web development—all areas in which Python is widely used."
    }
  ]


 